In [1]:
import pandas as pd

#### pd.df1.join(df2) 
* additional parameters:
* on
* how- left/right/inner/outer.................................. default- left
* lsuffix/rsuffix - similar to suffixes of merge

In [37]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value': [1, 2, 3, 4]})
df1

  key  value
0   A      1
1   B      2
2   C      3
3   D      4

In [38]:
df2 = pd.DataFrame({'key': ['B', 'D', 'E'], 'value': [5, 6, 7]})
df2

  key  value
0   B      5
1   D      6
2   E      7

In [20]:
df1.join(df2, lsuffix= '_1', rsuffix= '_2')

  key_1  value1 key_2  value2
0     A       1     B     5.0
1     B       2     D     6.0
2     C       3     E     7.0
3     D       4   NaN     NaN

In [30]:
# df1.join(df2, on='key')                 #this doesn't work; for on parameter to work use below syntax

In [39]:
df2 = df2.set_index('key')

In [45]:
df1.join(df2, on='key', lsuffix= '_A', rsuffix= '_B', how='outer')

    key  value_A  value_B
0.0   A      1.0      NaN
1.0   B      2.0      5.0
2.0   C      3.0      NaN
3.0   D      4.0      6.0
NaN   E      NaN      7.0